# ä¾¿åˆ©ãªæ©Ÿèƒ½ ğŸ’°

ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯æ–‡å­—åˆ—æ“ä½œã«é–¢ã™ã‚‹æ©Ÿèƒ½ã¨ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã«ã¤ã„ã¦ç´¹ä»‹ã—ã¾ã™ã€‚

## 1. åˆæœŸè¨­å®š

Jupyter Notebook ã‚’å†èµ·å‹•ã—ãŸå ´åˆãªã©ã¯ã“ã“ã‹ã‚‰å®Ÿè¡Œã—ã¦ãã ã•ã„ã€‚

In [ ]:
! pip install ipython-sql pymysql
%load_ext sql

## 2. æ¥ç¶šç¢ºèª

In [60]:
%%sql mysql+pymysql://hello:world@10.0.1.100/employees
select 'hello' as world

1 rows affected.

[('hello',)]

## 3. LIKE æ¼”ç®—å­

LIKE æ¼”ç®—å­ã‚’ä½¿ã†ã“ã¨ã§ç‰¹å®šã®ãƒ‘ã‚¿ãƒ¼ãƒ³ã«ãƒãƒƒãƒã™ã‚‹æ–‡å­—åˆ—ã‚’æ¤œç´¢ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```sql
<å¯¾è±¡æ–‡å­—åˆ—> LIKE <ãƒ‘ã‚¿ãƒ¼ãƒ³æ–‡å­—åˆ—>
```

ãƒ‘ã‚¿ãƒ¼ãƒ³æ–‡å­—åˆ—ã¯2ç¨®é¡ã®ç‰¹æ®Šæ–‡å­—ã‚’æŒã£ã¦ã„ã¾ã™ã€‚

- `%` ï¼ˆãƒ‘ãƒ¼ã‚»ãƒ³ãƒˆï¼‰
  - ä»»æ„ã®æ–‡å­—åˆ—ã«ãƒãƒƒãƒã—ã¾ã™
- `_`ï¼ˆã‚¢ãƒ³ãƒ€ãƒ¼ã‚¹ã‚³ã‚¢ï¼‰
  - ä»»æ„ã®ä¸€æ–‡å­—ã«ãƒãƒƒãƒã—ã¾ã™
- â€»ã“ã‚Œã‚‰ã®æ–‡å­—è‡ªä½“ã‚’ãƒ‘ã‚¿ãƒ¼ãƒ³ã«æŒ‡å®šã™ã‚‹å ´åˆã¯ `\%` ã®ã‚ˆã†ã«ã‚¨ã‚¹ã‚±ãƒ¼ãƒ—ã—ã¦ãã ã•ã„

ä»¥ä¸‹ã¯ `employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ `first_name` ãŒ `B` ã§å§‹ã¾ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’æ¤œç´¢ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [4]:
%%sql
select
    first_name,
    last_name
from
    employees
where
    first_name like 'B%'
limit 3

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[('Bezalel', 'Simmel'), ('Berni', 'Genin'), ('Bojan', 'Montemayor')]

`NOT` ã‚’ã¤ã‘ã‚‹ã¨ãƒãƒƒãƒã—ãªã„æ–‡å­—åˆ—ã‚’æ¤œç´¢ã§ãã¾ã™ã€‚

In [8]:
%%sql
select
    first_name,
    last_name
from
    employees
where
    first_name not like 'B%'
limit 3

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[('Georgi', 'Facello'), ('Parto', 'Bamford'), ('Chirstian', 'Koblick')]

`_` ã‚’ãƒ‘ã‚¿ãƒ¼ãƒ³æ–‡å­—åˆ—ã«æŒ‡å®šã™ã‚‹ã¨ä»»æ„ã®ä¸€æ–‡å­—ã«ãƒãƒƒãƒã™ã‚‹æ–‡å­—åˆ—ãŒæ¤œç´¢ã§ãã¾ã™ã€‚ä»¥ä¸‹ã¯"B"ã§å§‹ã¾ã‚‹5æ–‡å­—ã® `first_name` ã‚’æ¤œç´¢ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [7]:
%%sql
select
    first_name,
    last_name
from
    employees
where
    first_name like 'B____'
limit 3

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.

[('Berni', 'Genin'), ('Bojan', 'Montemayor'), ('Bader', 'Swan')]

## 4. REGEXP æ¼”ç®—å­

`REGEXP` æ¼”ç®—å­ã‚’ä½¿ã†ã¨æ­£è¦è¡¨ç¾ã‚’ä½¿ã£ã¦ `LIKE` æ¼”ç®—å­ã‚ˆã‚Šã‚‚è¤‡é›‘ãªãƒ‘ã‚¿ãƒ¼ãƒ³ã‚’æŒ‡å®šã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

> MySQL ã§ã¯ã€POSIX 1003.2 ã«æº–æ‹ ã™ã‚‹ã“ã¨ã‚’ç›®çš„ã¨ã—ãŸ Henry Spencer æ°ã«ã‚ˆã‚‹æ­£è¦è¡¨ç¾ã®å®Ÿè£…ãŒä½¿ç”¨ã•ã‚Œã¾ã™ã€‚
> https://dev.mysql.com/doc/refman/5.6/ja/regexp.html

ä»¥ä¸‹ã¯ `titles` ãƒ†ãƒ¼ãƒ–ãƒ«ã‹ã‚‰ A ã‹ã‚‰ E ã§å§‹ã¾ã‚‹ `title` ã‚’æ¤œç´¢ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚å¤§æ–‡å­—ã¨å°æ–‡å­—ãŒåŒºåˆ¥ã•ã‚Œãªã„ã“ã¨ã«æ³¨æ„ã—ã¾ã—ã‚‡ã†ã€‚

In [15]:
%%sql
select
    distinct
    title
from
    titles
where
    title regexp '^[a-e]'
limit 3

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.

[('Engineer',), ('Assistant Engineer',)]

## 5. ãƒ©ãƒ³ã‚­ãƒ³ã‚°ã®é›†è¨ˆ

ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ï¼ˆåˆ†æé–¢æ•°ï¼‰ã¯åˆ†æã‚¯ã‚¨ãƒªã§ã‚ˆãä½¿ã‚ã‚Œã‚‹å¼·åŠ›ãªæ©Ÿèƒ½ã®ä¸€ã¤ã§ã™ã€‚MySQL ã§ã¯é•·ã‚‰ãã‚µãƒãƒ¼ãƒˆã•ã‚Œã¦ã„ã¾ã›ã‚“ã§ã—ãŸãŒãƒãƒ¼ã‚¸ãƒ§ãƒ³ 8.0 ã‹ã‚‰åˆ©ç”¨ã§ãã‚‹ã‚ˆã†ã«ãªã‚Šã¾ã—ãŸã€‚

`GROUP BY` å¥ã‚’ä½¿ã£ãŸé›†ç´„ã§ã¯ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’æŒ‡å®šã—ãŸã‚«ãƒ©ãƒ ã®å€¤ã§ã‚°ãƒ«ãƒ¼ãƒ—åˆ†ã‘ã—å…¨ä½“ã«å¯¾ã—ã¦é›†è¨ˆã‚’ã‹ã‘ã‚‹ã“ã¨ãŒã§ãã¾ã—ãŸãŒã€ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã§ã¯ã‚ã‚‹è¡Œã«ã¤ã„ã¦å‰å¾Œé–¢ä¿‚ã‚„ã‚°ãƒ«ãƒ¼ãƒ—å†…ã§ä»–ã®è¡Œã‚’è€ƒæ…®ã—ãŸé›†è¨ˆã‚’è¡Œã†ã“ã¨ãŒã§ãã¾ã™ã€‚é›†ç´„ã¯é›†è¨ˆçµæœãŒä¸€ã¤ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã«ã¾ã¨ã¾ã‚‹ã®ã«å¯¾ã—ã¦ã€ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã‚’ä½¿ã£ãŸé›†è¨ˆã§ã¯å…ƒã®ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒãã®ã¾ã¾æ®‹ã‚‹å½¢ã§é›†è¨ˆã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã®å‘¼ã³å‡ºã—ã¯é€šå¸¸ã®é–¢æ•°ã¨é•ã£ã¦ `OVER` å¥ã‚’æŒ‡å®šã™ã‚‹å¿…è¦ãŒã‚ã‚Šã€æ§‹æ–‡ã«ã¤ã„ã¦ã¯ä»¥ä¸‹ã®ã‚ˆã†ã«ãªã‚Šã¾ã™ã€‚

```sql
SELECT
    é–¢æ•°å(<å¼•æ•°>) OVER (PARTITION BY <ã‚°ãƒ«ãƒ¼ãƒ—åˆ†ã‘ã™ã‚‹ã‚«ãƒ©ãƒ > ORDER BY <ä¸¦ã¹æ›¿ãˆã‚‹ã‚«ãƒ©ãƒ >)
```


ã“ã“ã§ã¯ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã®ä¸€ã¤ã§ã‚ã‚‹ `RANK` é–¢æ•°ã‚’ä½¿ã£ã¦ã€`salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ `salary` ãŒé«˜ã„ç¤¾å“¡ã®ãƒ©ãƒ³ã‚­ãƒ³ã‚°ã‚’é›†è¨ˆã—ã¦ã¿ã¾ã—ã‚‡ã†ã€‚

In [27]:
%%sql
select
    rank() over (order by salary desc) as ranking,
    emp_no,
    salary
from
    salaries
where
    to_date = '9999-01-01'
order by
    ranking
limit 10

 * mysql+pymysql://hello:***@10.0.1.100/employees
10 rows affected.

[(1, 43624, 158220),
 (2, 254466, 156286),
 (3, 47978, 155709),
 (4, 253939, 155513),
 (5, 109334, 155190),
 (6, 80823, 154459),
 (7, 493158, 154376),
 (8, 205000, 153715),
 (9, 266526, 152710),
 (10, 237542, 152687)]

## 6. LEAD é–¢æ•° / LAG é–¢æ•°

ã‚¦ã‚£ãƒ³ãƒ‰ã‚¦é–¢æ•°ã® LEAD é–¢æ•°ã¨ LAG é–¢æ•°ã‚’ä½¿ã†ã¨ã€ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã«ã¤ã„ã¦æŒ‡å®šã®é †åºã§å‰å¾Œã«ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æƒ…å ±ã‚’å–å¾—ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚ä½¿ç”¨ä¾‹ã«ã¤ã„ã¦ã¯æ—¥åˆ¥ã®ãƒ­ã‚°ã‚¤ãƒ³å±¥æ­´ãªã©ã§ãƒ­ã‚°ã‚¤ãƒ³ã—ãŸæ—¥ä»˜ã¨æ¬¡ã«ãƒ­ã‚°ã‚¤ãƒ³ã—ãŸæ—¥ä»˜ã‚’æ±‚ã‚ã‚‹ã“ã¨ã§ãƒ­ã‚°ã‚¤ãƒ³ã—ãªã‹ã£ãŸæ—¥æ•°ãªã©ã‚’æ±‚ã‚ãŸã‚Šã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚è¡Œå‹•ã®å‰å¾Œé–¢ä¿‚ã‚’ä¸€ã¤ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã¨ã—ã¦ä¿æŒã§ãã‚‹ã®ã§ãƒ¬ã‚³ãƒ¡ãƒ³ãƒ‰å‡¦ç†ã‚’è¡Œã†æ©Ÿæ¢°å­¦ç¿’ãƒ¢ãƒ‡ãƒ«ã®å…¥åŠ›ãƒ‡ãƒ¼ã‚¿ç”Ÿæˆãªã©ã«ã‚‚æ´»ç”¨ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [20]:
%%sql
drop table if exists tmp.logins;
create temporary table tmp.logins as
select
    cast('2019-04-01' as date) as date,
    123 as user_id
;

insert into tmp.logins values
    -- user_id=123 ã®ãƒ­ã‚°ã‚¤ãƒ³å±¥æ­´
    ('2019-04-02', 123),
    ('2019-04-04', 123),
    ('2019-04-05', 123),
    ('2019-04-06', 123),
    ('2019-04-07', 123),
    ('2019-04-08', 123),
    
    -- user_id=456 ã®ãƒ­ã‚°ã‚¤ãƒ³å±¥æ­´
    ('2019-04-02', 456),
    ('2019-04-04', 456),
    ('2019-04-05', 456),
    ('2019-04-06', 456),
    ('2019-04-07', 456),
    ('2019-04-08', 456)
;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.
1 rows affected.
12 rows affected.

[]

`LEAD` é–¢æ•°ã¯ `ORDER BY` å¥ã§æŒ‡å®šã—ãŸé †åºã§æ¬¡ã«æ¥ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æƒ…å ±ã‚’å–å¾—ã—ã¾ã™ã€‚ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå­˜åœ¨ã—ãªã„ã¨ãã¯ `NULL` ã‚’è¿”ã—ã¾ã™ã€‚

In [21]:
%%sql
select
    date,
    user_id,
    lead(date) over (partition by user_id order by date) as next_login_date
from
    tmp.logins

order by
    user_id,
    date

 * mysql+pymysql://hello:***@10.0.1.100/employees
13 rows affected.

[(datetime.date(2019, 4, 1), 123, datetime.date(2019, 4, 2)),
 (datetime.date(2019, 4, 2), 123, datetime.date(2019, 4, 4)),
 (datetime.date(2019, 4, 4), 123, datetime.date(2019, 4, 5)),
 (datetime.date(2019, 4, 5), 123, datetime.date(2019, 4, 6)),
 (datetime.date(2019, 4, 6), 123, datetime.date(2019, 4, 7)),
 (datetime.date(2019, 4, 7), 123, datetime.date(2019, 4, 8)),
 (datetime.date(2019, 4, 8), 123, None),
 (datetime.date(2019, 4, 2), 456, datetime.date(2019, 4, 4)),
 (datetime.date(2019, 4, 4), 456, datetime.date(2019, 4, 5)),
 (datetime.date(2019, 4, 5), 456, datetime.date(2019, 4, 6)),
 (datetime.date(2019, 4, 6), 456, datetime.date(2019, 4, 7)),
 (datetime.date(2019, 4, 7), 456, datetime.date(2019, 4, 8)),
 (datetime.date(2019, 4, 8), 456, None)]

`LAG` é–¢æ•°ã¯æŒ‡å®šé †ã§å‰ã«ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æƒ…å ±ã‚’å–å¾—ã—ã¾ã™ã€‚å¯¾å¿œã™ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå­˜åœ¨ã—ãªã„ã¨ãã¯ NULL ã‚’è¿”ã—ã¾ã™ã€‚

In [25]:
%%sql
select
    date,
    user_id,
    lag(date) over (partition by user_id order by date) as prev_login_date
from
    tmp.logins
    
order by
    user_id,
    date

 * mysql+pymysql://hello:***@10.0.1.100/employees
13 rows affected.

[(datetime.date(2019, 4, 1), 123, None),
 (datetime.date(2019, 4, 2), 123, datetime.date(2019, 4, 1)),
 (datetime.date(2019, 4, 4), 123, datetime.date(2019, 4, 2)),
 (datetime.date(2019, 4, 5), 123, datetime.date(2019, 4, 4)),
 (datetime.date(2019, 4, 6), 123, datetime.date(2019, 4, 5)),
 (datetime.date(2019, 4, 7), 123, datetime.date(2019, 4, 6)),
 (datetime.date(2019, 4, 8), 123, datetime.date(2019, 4, 7)),
 (datetime.date(2019, 4, 2), 456, None),
 (datetime.date(2019, 4, 4), 456, datetime.date(2019, 4, 2)),
 (datetime.date(2019, 4, 5), 456, datetime.date(2019, 4, 4)),
 (datetime.date(2019, 4, 6), 456, datetime.date(2019, 4, 5)),
 (datetime.date(2019, 4, 7), 456, datetime.date(2019, 4, 6)),
 (datetime.date(2019, 4, 8), 456, datetime.date(2019, 4, 7))]

ä»¥ä¸‹ã¯ãƒ¦ãƒ¼ã‚¶ãƒ¼åˆ¥ã«ãƒ­ã‚°ã‚¤ãƒ³ã—ãŸæ—¥ä»˜ã«ã¤ã„ã¦ãƒ­ã‚°ã‚¤ãƒ³ã—ã¦ã„ãªã‹ã£ãŸæ—¥æ•°ã‚’æ±‚ã‚ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚MySQL ã§ã¯ `DATEDIFF` é–¢æ•°ã‚’ä½¿ç”¨ã™ã‚‹ã“ã¨ã§æ—¥ä»˜ã®å·®åˆ†ã‚’è¨ˆç®—ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [33]:
%%sql
select
    user_id,
    date,
    datediff(date, prev_login_date) - 1 as not_login_days
from
    (select
        date,
        user_id,
        lag(date) over (partition by user_id order by date) as prev_login_date
    from
        tmp.logins
    ) as t1
    
order by
    user_id,
    date

 * mysql+pymysql://hello:***@10.0.1.100/employees
13 rows affected.

[(123, datetime.date(2019, 4, 1), None),
 (123, datetime.date(2019, 4, 2), 0),
 (123, datetime.date(2019, 4, 4), 1),
 (123, datetime.date(2019, 4, 5), 0),
 (123, datetime.date(2019, 4, 6), 0),
 (123, datetime.date(2019, 4, 7), 0),
 (123, datetime.date(2019, 4, 8), 0),
 (456, datetime.date(2019, 4, 2), None),
 (456, datetime.date(2019, 4, 4), 1),
 (456, datetime.date(2019, 4, 5), 0),
 (456, datetime.date(2019, 4, 6), 0),
 (456, datetime.date(2019, 4, 7), 0),
 (456, datetime.date(2019, 4, 8), 0)]

## ğŸŒ± ç·´ç¿’å•é¡Œ

`salaries` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦çµ¦æ–™ãŒé«˜ã„é †ã« `3940` ç•ªç›® / `3941` ç•ªç›® / `3942` ç•ªç›®ã§ã‚ã‚‹ç¤¾å“¡ã®çµ¦æ–™ã®ç·å’Œã‚’æ±‚ã‚ã¦ãã ã•ã„ã€‚ãŸã ã— `to_date` ã‚«ãƒ©ãƒ ãŒ `9999-01-01` ã§ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’å¯¾è±¡ã¨ã™ã‚‹ã‚‚ã®ã¨ã—ã¾ã™ã€‚

In [64]:
%%sql
-- ã“ã“ã«ã‚¯ã‚¨ãƒªã‚’å…¥åŠ›ã—ã¦ãã ã•ã„
select 42 as your_answer

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[(42,)]

**TIPS**: MySQL 8.0 ã‹ã‚‰ `CTE` (Common Table Expressions) ãŒã‚µãƒãƒ¼ãƒˆã•ã‚Œã¦ãŠã‚Šã€`WITH` å¥ã‚’ä½¿ã†ã“ã¨ã§ã‚µãƒ–ã‚¯ã‚¨ãƒªã‚’å†åˆ©ç”¨ã§ãã‚‹å½¢ã«è½ã¨ã—è¾¼ã‚€ã“ã¨ãŒã§ãã¾ã™ã€‚ã‚µãƒ–ã‚¯ã‚¨ãƒªã®ãƒã‚¹ãƒˆã‚’å›é¿ã§ãã‚‹ã»ã‹ã€ã‚µãƒ–ã‚¯ã‚¨ãƒªãŒã©ã†ã„ã†çµæœã‚’è¿”ã™ã®ã‹åˆ†ã‹ã‚‹ã‚ˆã†ãªåå‰ã‚’ã¤ã‘ã¦ãŠãã¨ã‚ã¨ã§è¦‹è¿”ã—ãŸã¨ãã«ã‚¯ã‚¨ãƒªãŒèª­ã¿ã‚„ã™ããªã‚Šã¾ã™ã€‚

https://dev.mysql.com/doc/refman/8.0/en/with.html

ä»¥ä¸‹ã¯ `WITH` å¥ã®åˆ©ç”¨ä¾‹ã«ãªã‚Šã¾ã™ã€‚

In [58]:
%%sql
with
    hello_cte as
    (select
        1
    )

select
    *
from
    hello_cte

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[(1,)]

ä»¥ä¸‹ã®ã‚³ãƒ¼ãƒ‰ã‚’å®Ÿè¡Œã—ã¦è§£ç­”ã‚’æå‡ºã—ã¦ãã ã•ã„ã€‚

In [ ]:
# å®Ÿè¡Œå¾Œã€"your answer" ã®å³å´ã«è¡¨ç¤ºã•ã‚Œã‚‹å…¥åŠ›ãƒœãƒƒã‚¯ã‚¹ã«ç­”ãˆã‚’å…¥åŠ›ã— Enter ã‚­ãƒ¼ã‚’æŠ¼ã—ã¦ãã ã•ã„ m(_ _)m
import urllib.request

answer = input('your answerï¼ˆçµ¦æ–™ã®å’Œï¼‰: ')

url = 'http://10.0.1.100:18080/submit'
data = 'q=q501&a={}'.format(answer.strip()).encode('utf-8')
req = urllib.request.Request(url, data=data, method='POST')
with urllib.request.urlopen(req) as res:
    print(res.read().decode('utf-8'))